Artillery/solucion.yml
config:
  target: "https://localhost:8443/api"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 40
      arrivalRate: 5
  http:
    pool: 8
  payload:
    path: "books.csv"
    fields:
      - "title"
      - "description"
  variables:
    admin:
      - "admin"
    user:
      - "user"
    password:
      - "pass"
  ensure:
    p95: 100
    maxErrorRate: 0
scenarios:
  - name: "Escenario 1: Consulta del primer Libro"
    weight: 7
    flow:
      - get:
          url: "/books/"
          capture:
            - json: "$[0].id"
            - as: id
            - json: "$[0].description"
            - as: description
          expect:
            statusCode: 200
            contentType: json
            equals:
              - "{{ id }}"
              - "SUEÑOS DE ACERO Y NEON"
              - "{{ description }}"
              - "Los personajes que protagonizan este relato sobreviven en una sociedad en decadencia a la que, no obstante, lograrán devolver la posibilidad de un futuro. Año 2484. En un mundo dominado por las grandes corporaciones, solo un hombre, Jordi Thompson, detective privado deslenguado y vividor, pero de gran talento y sentido d..."
  - name: "Escenario 2: Creación de un Libro"
    weight: 2
    flow:
      - get:
          url: "/logIn"
          auth:
            user: "{{ user }}"
            pass: "{{ password }}"
          expect:
            statusCode: 200
      - post:
          url: "/books/"
          json:
            title: "{{ title }}"
            description: "{{ description }}"
          capture:
            json: "$.id"
            as: id
          expect:
            statusCode: 201
            contentType: json
      - get:
          url: "/books/{{ id }}"
          capture:
            - json: "$.id"
            - as: id
            - json: "$.description"
            - as: summary
          expect:
            statusCode: 200
            contentType: json
            equals:
              - "{{ id }}"
              - "{{ title }}"
              - "{{ description }}"
              - "{{ summary }}"
  - name: "Escenario 3: Borrado de un Libro"
    weight: 1
    flow:
      - get:
          url: "/logIn"
          auth:
            user: "{{ admin }}"
            pass: "{{ password }}"
          expect:
            statusCode: 200
      - post:
          url: "/books/"
          json:
            title: "{{ title }}"
            description: "{{ description }}"
          capture:
            json: "$.id"
            as: id
          expect:
            statusCode: 201
      - get:
          url: "/books/{{ id }}"
          expect:
            statusCode: 200
      - delete:
          url: "/books/{{ id }}"
          expect:
            statusCode: 204
      - get:
          url: "/books/{{ id }}"
          expect:
            statusCode: 404